components/camel-cxf/src/test/resources/org/apache/camel/component/cxf/wsa/msg.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<Action xmlns="http://www.w3.org/2005/08/addressing">
			http://hello_world_soap_http.apache.org/GreeterPortType/greetMe
		</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">
			urn:uuid:d67279aa-9230-4e47-a57e-4166a44d9d96</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:9001/SoapContext/SoapPort
		</To>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous
			</Address>
		</ReplyTo>
	</soap:Header>
	<soap:Body>
		<ns1:greetMe xmlns:ns1="http://hello_world_soap_http.apache.org/">
			<ns2:arg0 xmlns="http://apache.org/hello_world_soap_http/types"
				xmlns:ns2="http://hello_world_soap_http.apache.org/">world!</ns2:arg0>
		</ns1:greetMe>
	</soap:Body>
</soap:Envelope>
